api/app/controllers/users_controller.rb

  def index
    user = User.all
---
SELECT "users".* FROM "users"

  def create
    user = User.create!(users_permit)
---
INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "Gabriel Wambugu"], ["email", "gabriel@yahoo.com"], ["password_digest", "[FILTERED]"], ["created_at", "2023-05-29 16:41:56.008201"], ["updated_at", "2023-05-29 16:41:56.008201"]]

  def destroy
    user = User.find_by(id: params[:id])
    user.delete
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 4]]